
<!DOCTYPE HTML>
<html lang="zh" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>心灵鸡汤 · 小航的学习总结</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        <meta name="author" content="Die4passion">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-prism/prism-ghcolors.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-toggle-chapters/toggle.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="rensheng.html" />
    
    
    <link rel="prev" href="78.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="輸入並搜尋" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    The Notes
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../linux/lx+.html">
            
                <a href="../linux/lx+.html">
            
                    
                    Linux类
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../linux/linxx.html">
            
                <a href="../linux/linxx.html">
            
                    
                    Linux三日速成
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../linux/mysql.html">
            
                <a href="../linux/mysql.html">
            
                    
                    mysql
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../linux/regular.html">
            
                <a href="../linux/regular.html">
            
                    
                    正则表达式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="../linux/Redis.html">
            
                <a href="../linux/Redis.html">
            
                    
                    Redis
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="../linux/youhua.html">
            
                <a href="../linux/youhua.html">
            
                    
                    大型网站优化
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../git/git-bash.html">
            
                <a href="../git/git-bash.html">
            
                    
                    git常用命令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../html/h+c.html">
            
                <a href="../html/h+c.html">
            
                    
                    html+css
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../html/HTML_DAY1.html">
            
                <a href="../html/HTML_DAY1.html">
            
                    
                    html-day1
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../html/HTML_DAY2.html">
            
                <a href="../html/HTML_DAY2.html">
            
                    
                    html-day2
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="../html/HTML_DAY3.html">
            
                <a href="../html/HTML_DAY3.html">
            
                    
                    html-day3
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="../html/CSS_DAY1.html">
            
                <a href="../html/CSS_DAY1.html">
            
                    
                    css-day1
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="../html/CSS_DAY2.html">
            
                <a href="../html/CSS_DAY2.html">
            
                    
                    css-day2
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.6" data-path="../html/CSS_DAY3.html">
            
                <a href="../html/CSS_DAY3.html">
            
                    
                    css-day3
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../js/js+.html">
            
                <a href="../js/js+.html">
            
                    
                    JS笔记
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../js/JAVASCRIPT_DAY1.html">
            
                <a href="../js/JAVASCRIPT_DAY1.html">
            
                    
                    JS-day1
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="../js/JAVASCRIPT_DAY2.html">
            
                <a href="../js/JAVASCRIPT_DAY2.html">
            
                    
                    JS-day2
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="../js/JAVASCRIPT_DAY3.html">
            
                <a href="../js/JAVASCRIPT_DAY3.html">
            
                    
                    JS-day3
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="78.html">
            
                <a href="78.html">
            
                    
                    杂七杂八
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.6.1" data-path="funny.html">
            
                <a href="funny.html">
            
                    
                    心灵鸡汤
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.2" data-path="rensheng.html">
            
                <a href="rensheng.html">
            
                    
                    程序算法与人生
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本書使用 GitBook 釋出
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >心灵鸡汤</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h3 id="&#x6B64;&#x6B21;&#x8425;&#x9500;&#x6D3B;&#x52A8;&#x7528;&#x5230;&#x7684;85&#x53E5;ugc&#x8BC4;&#x8BBA;&#x8282;&#x9009;">&#x6B64;&#x6B21;&#x8425;&#x9500;&#x6D3B;&#x52A8;&#x7528;&#x5230;&#x7684;85&#x53E5;UGC&#x8BC4;&#x8BBA;&#x8282;&#x9009;</h3>
<ol>
<li>&#x6211;&#x559C;&#x6B22;&#x6211;&#x671B;&#x5411;&#x522B;&#x5904;&#x65F6;&#x4F60;&#x843D;&#x5728;&#x6211;&#x8EAB;&#x4E0A;&#x7684;&#x76EE;&#x5149;</li>
<li>&#x4F60;&#x90A3;&#x4E48;&#x5B64;&#x72EC;&#xFF0C;&#x5374;&#x8BF4;&#x4E00;&#x4E2A;&#x4EBA;&#x771F;&#x597D;</li>
<li>&#x5F53;&#x4F60;&#x89C9;&#x5F97;&#x5B64;&#x72EC;&#x65E0;&#x52A9;&#x65F6;&#xFF0C;&#x60F3;&#x4E00;&#x60F3;&#x8FD8;&#x6709;&#x5341;&#x51E0;&#x4EBF;&#x7684;&#x7EC6;&#x80DE;&#x53EA;&#x4E3A;&#x4E86;&#x4F60;&#x4E00;&#x4E2A;&#x4EBA;&#x800C;&#x6D3B;</li>
<li>&#x4E00;&#x4E2A;&#x4EBA;&#x4E45;&#x4E86;&#xFF0C;&#x716E;&#x4E2A;&#x997A;&#x5B50;&#x770B;&#x89C1;&#x4E24;&#x4E2A;&#x7C98;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x4E5F;&#x8981;&#x7ED9;&#x5B83;&#x5206;&#x5F00;&#xFF01;</li>
<li>&#x6211;&#x4ECE;&#x672A;&#x62E5;&#x6709;&#x8FC7;&#x4F60;&#x4E00;&#x79D2;&#x949F;&#xFF0C;&#x5FC3;&#x91CC;&#x5374;&#x5931;&#x53BB;&#x8FC7;&#x4F60;&#x5343;&#x4E07;&#x6B21;&#x3002;</li>
<li>&#x6821;&#x670D;&#x662F;&#x6211;&#x548C;&#x5979;&#x552F;&#x4E00;&#x7A7F;&#x8FC7;&#x7684;&#x60C5;&#x4FA3;&#x88C5;&#xFF0C;&#x6BD5;&#x4E1A;&#x7167;&#x662F;&#x6211;&#x548C;&#x5979;&#x552F;&#x4E00;&#x7684;&#x5408;&#x5F71;&#x3002;</li>
<li>&#x4EBA;&#x751F;&#x7684;&#x51FA;&#x573A;&#x987A;&#x5E8F;&#x592A;&#x91CD;&#x8981;&#x4E86;</li>
<li>&#x7406;&#x60F3;&#x5C31;&#x662F;&#x79BB;&#x4E61;&#x3002;</li>
<li>&#x4E16;&#x754C;&#x5982;&#x6B64;&#x5E7F;&#x9614;&#xFF0C;&#x4EBA;&#x7C7B;&#x5374;&#x8D70;&#x8FDB;&#x4E86;&#x60B2;&#x4F24;&#x7684;&#x5899;&#x89D2;</li>
<li>&#x6211;&#x60F3;&#x505A;&#x4E00;&#x4E2A;&#x80FD;&#x5728;&#x4F60;&#x7684;&#x846C;&#x793C;&#x4E0A;&#x63CF;&#x8FF0;&#x4F60;&#x4E00;&#x751F;&#x7684;&#x4EBA;&#x3002;</li>
<li>&#x8C22;&#x8C22;&#x4F60;&#x966A;&#x6211;&#x6821;&#x670D;&#x5230;&#x793C;&#x670D;&#x3002;</li>
<li>&#x5468;&#x6770;&#x4F26;&#x628A;&#x7231;&#x60C5;&#x6BD4;&#x55BB;&#x6210;&#x9F99;&#x5377;&#x98CE;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x7279;&#x522B;&#x8D34;&#x5207;&#x3002;&#x56E0;&#x4E3A;&#x5F88;&#x591A;&#x4EBA;&#xFF0C;&#x50CF;&#x6211;&#x3002;&#x4E00;&#x8F88;&#x5B50;&#x90FD;&#x6CA1;&#x89C1;&#x8FC7;&#x9F99;&#x5377;&#x98CE;&#x3002;</li>
<li>&#x5C0F;&#x65F6;&#x5019;&#x522E;&#x5956;&#x522E;&#x51FA;&#x201C;&#x8C22;&#x201D;&#x5B57;&#x8FD8;&#x4E0D;&#x6254;&#xFF0C;&#x975E;&#x8981;&#x628A;&#x201C;&#x8C22;&#x8C22;&#x60E0;&#x987E;&#x201D;&#x90FD;&#x522E;&#x7684;&#x5E72;&#x5E72;&#x51C0;&#x51C0;&#x624D;&#x820D;&#x5F97;&#x653E;&#x624B;&#xFF0C;&#x548C;&#x540E;&#x6765;&#x592A;&#x591A;&#x7684;&#x4E8B;&#x4E00;&#x6A21;&#x4E00;&#x6837;&#x3002;</li>
<li>&#x559C;&#x6B22;&#x8FD9;&#x79CD;&#x4E1C;&#x897F;&#xFF0C;&#x6342;&#x4F4F;&#x5634;&#x5DF4;&#xFF0C;&#x4E5F;&#x4F1A;&#x4ECE;&#x773C;&#x775B;&#x91CC;&#x8DD1;&#x51FA;&#x6765;</li>
<li>&#x201C;&#x4F60;&#x8FD8;&#x8BB0;&#x5F97;&#x5979;&#x5417;&#xFF1F;&#x201D; &#x201C;&#x65E9;&#x5FD8;&#x4E86;&#xFF0C;&#x54C8;&#x54C8;&#x201D; &#x201C;&#x6211;&#x8FD8;&#x6CA1;&#x8BF4;&#x662F;&#x8C01;&#x3002;&#x201D;</li>
<li>&#x8BF7;&#x5728;&#x5BF9;&#x4E0D;&#x8D77;&#x4E2D;&#x52A0;&#x4E24;&#x4E2A;&#x5B57;&#x4F7F;&#x5176;&#x66F4;&#x52A0;&#x60B2;&#x4F24;&#x2014;&#x2014;&#x201C;&#x5BF9;&#x4E09;&#xFF0C;&#x8981;&#x4E0D;&#x8D77;&#x201D;</li>
<li>&#x6211;&#x542C;&#x8FC7;&#x4E00;&#x4E07;&#x9996;&#x6B4C;&#xFF0C;&#x770B;&#x8FC7;&#x4E00;&#x5343;&#x90E8;&#x7535;&#x5F71;&#xFF0C;&#x8BFB;&#x8FC7;&#x4E00;&#x767E;&#x672C;&#x4E66;&#xFF0C;&#x5374;&#x4ECE;&#x672A;&#x4FD8;&#x83B7;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x5FC3;</li>
<li>&#x5E74;&#x8F7B;&#x65F6;&#x6211;&#x60F3;&#x53D8;&#x6210;&#x4EFB;&#x4F55;&#x4EBA;&#xFF0C;&#x9664;&#x4E86;&#x6211;&#x81EA;&#x5DF1;&#x3002;</li>
<li>&#x6211;&#x4E0D;&#x559C;&#x6B22;&#x8FD9;&#x4E16;&#x754C;&#xFF0C;&#x6211;&#x53EA;&#x559C;&#x6B22;&#x4F60;&#x3002;</li>
<li>&#x73B0;&#x5728;&#x7EAF;&#x79CD;&#x7684;&#x6740;&#x9A6C;&#x7279;&#x8D8A;&#x6765;&#x8D8A;&#x5C11;&#x4E86;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x987D;&#x5F3A;&#x7684;&#x6D3B;&#x4E0B;&#x53BB;&#x554A;&#xFF01;&#x4E0D;&#x8981;&#x8BA9;&#x767D;&#x53D1;&#x4EBA;&#x9001;&#x8D64;&#x6A59;&#x9EC4;&#x7EFF;&#x9752;&#x84DD;&#x7D2B;&#x53D1;&#x4EBA;&#x554A;&#xFF01;</li>
<li>&#x6211;&#x79BB;&#x5929;&#x7A7A;&#x6700;&#x8FD1;&#x7684;&#x4E00;&#x6B21;&#xFF0C;&#x662F;&#x4F60;&#x628A;&#x6211;&#x9AD8;&#x9AD8;&#x5730;&#x4E3E;&#x8FC7;&#x4E86;&#x4F60;&#x7684;&#x80A9;&#x5934;&#x3002;</li>
<li>&#x54ED;&#x7740;&#x5403;&#x8FC7;&#x996D;&#x7684;&#x4EBA;&#xFF0C;&#x662F;&#x80FD;&#x591F;&#x8D70;&#x4E0B;&#x53BB;&#x7684;&#x3002;</li>
<li>&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x88C2;&#x75D5;&#xFF0C;&#x6700;&#x540E;&#x90FD;&#x4F1A;&#x53D8;&#x6210;&#x6545;&#x4E8B;&#x7684;&#x82B1;&#x7EB9;&#x3002;</li>
<li>&#x597D;&#x6000;&#x5FF5;&#x505A;&#x65E9;&#x64CD;&#x65F6;&#x603B;&#x662F;&#x4F1A;&#x5077;&#x770B;&#x81EA;&#x5DF1;&#x559C;&#x6B22;&#x7684;&#x4EBA;&#x3002;</li>
<li>&#x591A;&#x5C11;&#x4EBA;&#x4EE5;&#x670B;&#x53CB;&#x7684;&#x540D;&#x4E49;&#x9ED8;&#x9ED8;&#x7684;&#x7231;&#x7740;</li>
<li>&#x559C;&#x6B22;&#x4E00;&#x4E2A;&#x4EBA;&#x5B64;&#x72EC;&#x7684;&#x65F6;&#x523B; &#x4F46;&#x4E0D;&#x80FD;&#x559C;&#x6B22;&#x592A;&#x591A;</li>
<li>&#x4E0D;&#x7231;&#x4E86; &#x8FDE;&#x56DE;&#x5FC6; &#x90FD;&#x662F;&#x8D1F;&#x8377;</li>
<li>&#x5341;&#x5E74;&#x524D;&#x4F60;&#x8BF4;&#x751F;&#x5982;&#x590F;&#x82B1;&#x822C;&#x7EDA;&#x70C2;&#xFF0C;&#x5341;&#x5E74;&#x540E;&#x4F60;&#x8BF4;&#x5E73;&#x51E1;&#x624D;&#x662F;&#x552F;&#x4E00;&#x7684;&#x7B54;&#x6848;</li>
<li>&#x4E0D;&#x5728;&#x4E00;&#x8D77;&#x5C31;&#x4E0D;&#x5728;&#x4E00;&#x8D77;&#x5427;&#xFF0C;&#x53CD;&#x6B63;&#x4E00;&#x8F88;&#x5B50;&#x4E5F;&#x6CA1;&#x591A;&#x957F;&#x3002;</li>
<li>&#x5982;&#x679C;&#x6709;&#x4E00;&#x5929;&#xFF0C;&#x6211;&#x6709;&#x673A;&#x4F1A;&#x78B0;&#x4E0A;&#x559C;&#x6B22;&#x7684;&#x7537;&#x5B69;&#x5B50;&#xFF0C;&#x613F;&#x610F;&#x4E00;&#x8D77;&#x8FC7;&#x4E00;&#x751F;&#x7684;&#x7537;&#x5B69;&#x5B50;&#xFF0C;&#x5C31;&#x7528;&#x8FD9;&#x9996;&#x4F5C;&#x5A5A;&#x793C;&#x80CC;&#x666F;&#x66F2;&#x5427;&#x3002;&#x5173;&#x4E8E;&#x7231;&#x60C5;&#xFF0C;&#x5173;&#x4E8E;&#x5A5A;&#x793C;&#xFF0C;&#x6211;&#x4EC0;&#x4E48;&#x90FD;&#x60F3;&#x597D;&#x4E86;&#xFF0C;&#x4F60;&#x8981;&#x5FEB;&#x70B9;&#x51FA;&#x73B0;&#x624D;&#x597D;&#x3002;</li>
<li>&#x522B;&#x4EBA;&#x7A0D;&#x4E00;&#x6CE8;&#x610F;&#x4F60;&#xFF0C;&#x4F60;&#x5C31;&#x655E;&#x5F00;&#x5FC3;&#x6249;&#xFF0C;&#x4F60;&#x89C9;&#x5F97;&#x8FD9;&#x662F;&#x5766;&#x7387;&#xFF0C;&#x5176;&#x5B9E;&#x8FD9;&#x662F;&#x5B64;&#x72EC;&#x2026;&#x2026;</li>
<li>&#x6709;&#x591A;&#x5C11;&#x4EBA;&#x6234;&#x7740;&#x8033;&#x673A;&#x542C;&#x7740;&#x81EA;&#x5DF1;&#x60C5;&#x6709;&#x72EC;&#x949F;&#x7684;&#x97F3;&#x4E50;&#xFF0C;&#x5B64;&#x72EC;&#x7684;&#x5728;&#x62E5;&#x6324;&#x7684;&#x516C;&#x4EA4;&#x8F66;&#x4E0A;&#x65E5;&#x65E5;&#x591C;&#x591C;&#x5728;&#x4E0D;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x57CE;&#x5E02;&#x91CC;&#x5B64;&#x72EC;&#x7684;&#x751F;&#x6D3B;&#x7740;</li>
<li>&#x6211;&#x5DF2;&#x7ECF;&#x8FC7;&#x4E86;&#x9910;&#x684C;&#x4E0A;&#x6709;&#x53EA;&#x9E21;&#x5C31;&#x4E00;&#x5B9A;&#x80FD;&#x5403;&#x5230;&#x9E21;&#x817F;&#x7684;&#x5E74;&#x7EAA;&#x4E86;&#x3002;</li>
<li>&#x6211;&#x8BF4;&#xFF0C;&#x6211;&#x8981;&#x7528;&#x4E00;&#x751F;&#x5B66;&#x8FD9;&#x9996;&#x6B4C;&#xFF0C;&#x7136;&#x540E;&#x5531;&#x7ED9;&#x5979;&#x542C;&#xFF0C;&#x95EE;&#x5979;&#x613F;&#x610F;&#x966A;&#x6211;&#x5417;&#xFF1F;&#x5979;&#x8BF4;&#xFF0C;&#x5979;&#x4F1A;&#x966A;&#x6211;&#x4E00;&#x8D77;&#x5B66;</li>
<li>&#x5176;&#x5B9E;&#x5B64;&#x72EC;&#x4E24;&#x4E2A;&#x5B57;&#x62C6;&#x5F00;&#x770B;&#x5427;&#xFF0C;&#x6709;&#x5C0F;&#x5B69;&#xFF0C;&#x6709;&#x6C34;&#x679C;&#xFF0C;&#x6709;&#x8D70;&#x517D;&#xFF0C;&#x6709;&#x868A;&#x8747;&#xFF0C;&#x8DB3;&#x4EE5;&#x6491;&#x8D77;&#x4E00;&#x4E2A;&#x76DB;&#x590F;&#x508D;&#x665A;&#x7684;&#x5DF7;&#x5B50;&#x53E3;&#xFF0C;&#x7199;&#x7199;&#x6518;&#x6518;&#xFF0C;&#x4EBA;&#x5473;&#x5341;&#x8DB3;&#x3002;</li>
<li>&#x6700;&#x6015;&#x4E00;&#x751F;&#x788C;&#x788C;&#x65E0;&#x4E3A;&#xFF0C;&#x8FD8;&#x8BF4;&#x5E73;&#x51E1;&#x96BE;&#x80FD;&#x53EF;&#x8D35;&#x3002;</li>
<li>&#x8033;&#x673A;&#x91CC;&#x9762;&#x662F;&#x559C;&#x6B22;&#x4F46;&#x8FD8;&#x4E0D;&#x4F1A;&#x5531;&#x7684;&#x6B4C; &#x624B;&#x673A;&#x5C4F;&#x5E55;&#x4E0A;&#x7684;&#x7167;&#x7247;&#x662F;&#x559C;&#x6B22;&#x4F46;&#x8FD8;&#x6CA1;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x4EBA;</li>
<li>&#x7B49;&#x6211;&#x55E8;&#x6B7B;&#x540E;&#x628A;&#x6211;&#x7684;&#x9AA8;&#x7070;&#x6492;&#x5230;&#x6D77;&#x91CC;&#xFF0C;&#x4E0D;&#x662F;&#x6015;&#x6709;&#x4EBA;&#x5728;&#x575F;&#x5934;&#x8E66;&#x8FEA;&#xFF0C;&#x4E5F;&#x4E0D;&#x4E3A;&#x5927;&#x6D77;&#x66F4;&#x5BBD;&#x5E7F;&#xFF0C;&#x53EA;&#x662F;&#x4E3A;&#x4E86;&#x6211;&#x6B7B;&#x4E86;&#x4E5F;&#x80FD;&#x6D6A;&#x8D77;&#x6765;&#x3002;</li>
<li>&#x60F3;&#x5BF9;&#x65E9;&#x8D77;&#x7684;&#x5BA4;&#x53CB;&#x8BF4;&#xFF0C;&#x4E11;&#x516B;&#x602A;&#x554A;&#x554A;&#x554A;&#xFF0C;&#x80FD;&#x5426;&#x522B;&#x628A;&#x706F;&#x6253;&#x5F00;</li>
<li>&#x8BB0;&#x5F97;&#x5F53;&#x5E74;&#x4ED6;&#x6CA1;&#x8BF4;&#x51FA;&#x7684;&#x544A;&#x767D;&#xFF0C;&#x5374;&#x6210;&#x4E86;&#x90A3;&#x4E2A;&#x5E74;&#x7EAA;&#x9752;&#x6DA9;&#x7684;&#x6700;&#x7F8E;&#x3002;</li>
<li>&#x201C;&#x4F60;&#x77E5;&#x9053;&#x6DF1;&#x7231;&#x4E00;&#x4E2A;&#x4EBA;&#x662F;&#x4EC0;&#x4E48;&#x611F;&#x89C9;&#x5417;&#x201D;&#x201C;&#x5C31;&#x50CF;&#x623F;&#x95F4;&#x91CC;&#x9ED1;&#x4E86;&#x4F60;&#x4E0D;&#x662F;&#x5148;&#x53BB;&#x627E;&#x706F;&#xFF0C;&#x800C;&#x662F;&#x5148;&#x53BB;&#x627E;&#x4ED6;&#x3002;&#x201D;</li>
<li>&#x6709;&#x65F6;&#x5019;&#x542C;&#x6B4C;&#x88AB;&#x611F;&#x52A8;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x65CB;&#x5F8B;&#x6709;&#x591A;&#x68D2;&#xFF0C;&#x6B4C;&#x8BCD;&#x6709;&#x591A;&#x597D;&#xFF0C;&#x800C;&#x662F;&#x56E0;&#x4E3A;&#x60F3;&#x8D77;&#x4E86;&#x4EE5;&#x524D;&#x542C;&#x8FD9;&#x9996;&#x6B4C;&#x65F6;&#x4F60;&#x505A;&#x7684;&#x4E8B;&#xFF0C;&#x4F60;&#x548C;&#x8C01;&#x542C;&#x4E86;&#x8FD9;&#x9996;&#x6B4C;&#x3002;</li>
<li>&#x90A3;&#x5E74;&#x4E0A;&#x521D;&#x4E2D;&#xFF0C;&#x590F;&#x5929;&#x662F;&#x597D;&#x6F2B;&#x957F;&#x7684;&#xFF0C;&#x897F;&#x74DC;&#x662F;&#x5403;&#x4E0D;&#x5B8C;&#x7684;&#xFF0C;&#x4F5C;&#x4E1A;&#x662F;&#x6700;&#x540E;&#x4E24;&#x5929;&#x624D;&#x8D76;&#x7684;</li>
<li>&#x4F53;&#x80B2;&#x8BFE;&#x4E0A;&#x5E26;&#x4F60;&#x53BB;&#x5C0F;&#x5356;&#x5E97;&#x4E70;&#x7CD6;&#x5403;&#xFF0C;&#x4F60;&#x9AD8;&#x5174;&#x7684;&#x9A6C;&#x5C3E;&#x8E66;&#x54D2;&#x4E86;&#x4E00;&#x8DEF;</li>
<li>&#x6210;&#x529F;&#x7684;&#x901F;&#x5EA6;&#x4E00;&#x5B9A;&#x8981;&#x5FEB;&#x8FC7;&#x7236;&#x6BCD;&#x8001;&#x53BB;&#x7684;&#x901F;&#x5EA6;</li>
<li>&#x5C0F;&#x65F6;&#x5019;&#x603B;&#x662F;&#x9A97;&#x7238;&#x5988;&#x81EA;&#x5DF1;&#x6CA1;&#x94B1;&#x4E86;&#xFF0C;&#x73B0;&#x5728;&#x9A97;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x8FD8;&#x6709;&#x94B1;&#x3002;</li>
<li>&#x4F60;&#x90A3;&#x4E48;&#x64C5;&#x957F;&#x5B89;&#x6170;&#x4ED6;&#x4EBA;&#xFF0C;&#x4E00;&#x5B9A;&#x5EA6;&#x8FC7;&#x4E86;&#x5F88;&#x591A;&#x81EA;&#x5DF1;&#x5B89;&#x6170;&#x81EA;&#x5DF1;&#x7684;&#x65E5;&#x5B50;&#x5427;&#x3002;</li>
<li>&#x795D;&#x4F60;&#x4EEC;&#x5E78;&#x798F;&#x662F;&#x5047;&#x7684;&#xFF0C;&#x795D;&#x4F60;&#x5E78;&#x798F;&#x662F;&#x771F;&#x7684;&#x3002;</li>
<li>&#x5982;&#x679C;&#x6709;&#x4E00;&#x5929;&#x4F60;&#x8868;&#x767D;&#x6210;&#x529F;&#x4E86; &#x7EDD;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x4F60;&#x611F;&#x52A8;&#x4E86;&#x6211; &#x800C;&#x662F;&#x6211;&#x7B03;&#x5B9A;&#x6211;&#x53EF;&#x4EE5;&#x7231;&#x4F60;&#x66F4;&#x591A;</li>
<li>&#x4F59;&#x751F;&#x597D;&#x957F;&#xFF0C;&#x4F60;&#x597D;&#x96BE;&#x5FD8;&#x3002;</li>
<li>&#x6700;&#x540E;&#x7684;&#x4E00;&#x8282;&#x8BED;&#x6587;&#x8BFE;&#xFF0C;&#x8001;&#x5E08;&#x542C;&#x5199;&#xFF0C;&#x542C;&#x5199;&#x7684;&#x662F;&#x5168;&#x73ED;&#x4EBA;&#x7684;&#x540D;&#x5B57;&#x3002;</li>
<li>&#x4EFB;&#x4ED6;&#x4EEC;&#x591A;&#x6F02;&#x4EAE;&#xFF0C;&#x672A;&#x53CA;&#x4F60;&#x77DC;&#x8D35;&#x3002;</li>
<li>&#x521D;&#x604B;&#x7684;&#x5473;&#x9053;&#xFF0C;&#x4E00;&#x4EBA;&#x4E00;&#x53EA;&#x8033;&#x673A;&#xFF0C;&#x501A;&#x5728;&#x6811;&#x4E0B;&#xFF0C;&#x4E24;&#x624B;&#x6162;&#x6162;&#x9760;&#x8FD1;&#x2026;&#x2026;</li>
<li>&#x6211;&#x5728;&#x6700;&#x6CA1;&#x6709;&#x80FD;&#x529B;&#x7684;&#x5E74;&#x7EAA;&#xFF0C;&#x78B0;&#x89C1;&#x4E86;&#x6700;&#x60F3;&#x7167;&#x987E;&#x4E00;&#x751F;&#x7684;&#x4EBA;&#x3002;</li>
<li>&#x7A76;&#x7ADF;&#x6709;&#x591A;&#x559C;&#x6B22; &#x624D;&#x4F1A;&#x6E29;&#x67D4;&#x6210;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;</li>
<li>&#x4F60;&#x522B;&#x76B1;&#x7709;&#xFF0C;&#x6211;&#x8D70;&#x5C31;&#x597D;&#x3002;</li>
<li>&#x9A6C;&#x4E0A;&#x5C31;&#x8981;&#x7ED3;&#x675F;&#x4E00;&#x5E74;&#x7684;&#x5355;&#x8EAB;&#x751F;&#x6D3B;&#xFF0C;&#x5F00;&#x59CB;&#x65B0;&#x4E00;&#x5E74;&#x7684;&#x5355;&#x8EAB;&#x751F;&#x6D3B;&#x5566;</li>
<li>&#x201C;&#x5F88;&#x9AD8;&#x5174;&#x8BA4;&#x8BC6;&#x4F60;&#xFF01;&#x201D;&#x201C;&#x522B;&#x9AD8;&#x5174;&#x5F97;&#x592A;&#x65E9;&#x3002;&#x201D;</li>
<li>&#x89C4;&#x77E9;&#x4E00;&#x65E6;&#x592A;&#x591A;&#xFF0C;&#x4EBA;&#x5F80;&#x5F80;&#x5C31;&#x4F1A;&#x53EA;&#x6CE8;&#x610F;&#x89C4;&#x77E9;&#x800C;&#x5FD8;&#x8BB0;&#x771F;&#x6B63;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5; &#x3002;</li>
<li>&#x5934;&#x8111;&#x6709;&#x65F6;&#x5019;&#x786E;&#x5B9E;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x4F46;&#x662F;&#x771F;&#x6B63;&#x6709;&#x529B;&#x91CF;&#x7684;&#xFF0C;&#x662F;&#x7075;&#x9B42;&#x3002;</li>
<li>&#x601D;&#x60F3;&#x6BD4;&#x4EE3;&#x7801;&#x66F4;&#x95EA;&#x5149;&#xFF0C;&#x4F46;&#x6CA1;&#x6709;&#x4EE3;&#x7801;&#xFF0C;&#x601D;&#x60F3;&#x662F;&#x6CA1;&#x6709;&#x8EAF;&#x4F53;&#x7684;&#x3002;</li>
<li>&#x663E;&#x7136;&#xFF0C;&#x8D70;&#x8FD9;&#x6761;&#x8DEF;&#xFF0C;&#x53EF;&#x4EE5;&#x6323;&#x5927;&#x94B1;&#xFF0C;&#x800C;&#x4E14;&#x4F7F;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x5DE5;&#x4F5C;&#x589E;&#x6DFB;&#x4E00;&#x4EFD;&#x91D1;&#x94B1;&#x4E0A;&#x7684;&#x5FEB;&#x4E50;&#x3002;&#x4F46;&#x662F;&#x6211;&#x77E5;&#x9053;&#xFF0C;&#x7B49;&#x5230;&#x81EA;&#x5DF1;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#x7EC8;&#x7ED3;&#x65F6;&#xFF0C;&#x6211;&#x518D;&#x56DE;&#x9996;&#x8FD9;&#x4E9B;&#x5E74;&#x4E3A;&#x5206;&#x79BB;&#x4EBA;&#x7C7B;&#x800C;&#x780C;&#x9020;&#x7684;&#x2018;&#x5899;&#x58C1;&#x2019;&#x3002;&#x6211;&#x4F1A;&#x611F;&#x53D7;&#x5230;&#xFF0C;&#x6211;&#x5C06;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x751F;&#x90FD;&#x7528;&#x5728;&#x4F7F;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x7CDF;&#x7CD5;&#x3002;</li>
</ol>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="78.html" class="navigation navigation-prev " aria-label="Previous page: 杂七杂八">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="rensheng.html" class="navigation navigation-next " aria-label="Next page: 程序算法与人生">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"心灵鸡汤","level":"1.6.1","depth":2,"next":{"title":"程序算法与人生","level":"1.6.2","depth":2,"path":"others/rensheng.md","ref":"others/rensheng.md","articles":[]},"previous":{"title":"杂七杂八","level":"1.6","depth":1,"path":"others/78.md","ref":"others/78.md","articles":[{"title":"心灵鸡汤","level":"1.6.1","depth":2,"path":"others/funny.md","ref":"others/funny.md","articles":[]},{"title":"程序算法与人生","level":"1.6.2","depth":2,"path":"others/rensheng.md","ref":"others/rensheng.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["github","prism","splitter","-highlight","-sharing","prism-themes","toggle-chapters","editlink","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"prism":{"css":["prism-themes/themes/prism-ghcolors.css"]},"github":{"url":"https://github.com/Die4passion"},"editlink":{"label":"Edit","multilingual":false,"base":"https://github.com/Die4passion/notes/blob/master/"},"livereload":{},"splitter":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"prism-themes":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"toggle-chapters":{}},"theme":"default","author":"Die4passion","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"小航的学习总结","language":"zh","gitbook":"*","description":"一个注定不平凡的程序员"},"file":{"path":"others/funny.md","mtime":"2017-05-29T12:57:04.180Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-05-31T13:10:35.166Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-toggle-chapters/toggle.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-editlink/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

